BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_INT.c
                    /* Update Scan Counter */
                    `$INSTANCE_NAME`_dsRam.scanCounter++;

                    /* Sensor is totally scanned. Reset BUSY flag */
                    `$INSTANCE_NAME`_dsRam.status &= ~(`$INSTANCE_NAME`_SW_STS_BUSY | `$INSTANCE_NAME`_WDGT_SW_STS_BUSY);
                }
            #else
                {
                    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
                        /*  Disable CSDv2 block */
                    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CONFIG_PTR, `$INSTANCE_NAME`_configCsd);
                    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

                    /* Update Scan Counter */
                    `$INSTANCE_NAME`_dsRam.scanCounter++;

                    /* Sensor is totally scanned. Reset BUSY flag */
                    `$INSTANCE_NAME`_dsRam.status &= ~(`$INSTANCE_NAME`_SW_STS_BUSY | `$INSTANCE_NAME`_WDGT_SW_STS_BUSY);
                }
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
        }
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */

        #ifdef `$INSTANCE_NAME`_EXIT_CALLBACK
            `$INSTANCE_NAME`_ExitCallback();
        #endif /* `$INSTANCE_NAME`_EXIT_CALLBACK */
    }


    /*******************************************************************************
    * Function Name: `$INSTANCE_NAME`_CSDPostMultiScan
    ****************************************************************************//**
    *
    * \brief
    *  This is an internal ISR function for the multiple-sensor scanning
    *  implementation.
    *
    * \details
    *  This ISR handler is triggered when the user calls the
    *  `$INSTANCE_NAME`_Scan() or `$INSTANCE_NAME`_ScanAllWidgets() APIs.
    *
    *  The following tasks are performed:
    *    1. Disable the CSD interrupt.
    *    2. Read the Counter register and update the data structure with raw data.
    *    3. Connect the Vref buffer to the AMUX bus.
    *    4. Disable the CSD block (after the widget has been scanned).
    *    5. Update the Scan Counter.
    *    6. Reset the BUSY flag.
    *    7. Enable the CSD interrupt.
    *
    *  The ISR handler initializes scanning for the previous sensor when the
    *  widget has more than one sensor.
    *  The ISR handler initializes scanning for the next widget when the
    *  `$INSTANCE_NAME`_ScanAllWidgets() APIs are called and the project has
    *  more than one widget.
    *  The ISR handler changes the IMO and initializes scanning for the next
    *  frequency channels when multi-frequency scanning is enabled.
    *
    *  This function has two Macro Callbacks that allow calling the user
    *  code from macros specified in component's generated code. Refer to the
    *  \ref group_capsense_macrocallbacks section of the PSoC Creator User Guide
    *  for details.
    *
    *******************************************************************************/
    void `$INSTANCE_NAME`_CSDPostMultiScan(void)
    {
        /*  Declare and initialise ptr to sensor IO structure to appropriate address        */
        `$INSTANCE_NAME`_FLASH_IO_STRUCT const *curSnsIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)
                                                          `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2SnsFlash
                                                          + `$INSTANCE_NAME`_sensorIndex;

        #ifdef `$INSTANCE_NAME`_ENTRY_CALLBACK
            `$INSTANCE_NAME`_EntryCallback();
        #endif /* `$INSTANCE_NAME`_ENTRY_CALLBACK */

        CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
        (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
        if ((`$INSTANCE_NAME`_CSD_NOISE_METRIC_TH < ((CY_GET_REG32(`$INSTANCE_NAME`_CSD_RESULT_VAL1_PTR) &
                                                  `$INSTANCE_NAME`_CSD_RESULT_VAL1_BAD_CONVS_MSK) >>
                                                  `$INSTANCE_NAME`_CSD_RESULT_VAL1_BAD_CONVS_POS)) &&
                                                  (0u < `$INSTANCE_NAME`_badConversionsNum))
        {
            /* Decrement bad conversions number */
            `$INSTANCE_NAME`_badConversionsNum--;

            /* Start the re-scan */
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_CSD_SEQ_START_AZ0_SKIP_MSK |
                                                         `$INSTANCE_NAME`_CSD_SEQ_START_AZ1_SKIP_MSK |
                                                         `$INSTANCE_NAME`_CSD_SEQ_START_START_MSK);
        }
        else
        {
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */

        `$INSTANCE_NAME`_SsCSDPostScan();

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
            /* Disable sensor when all frequency channels are scanned */
            if (`$INSTANCE_NAME`_FREQ_CHANNEL_2 == `$INSTANCE_NAME`_scanFreqIndex)
            {
                /* Disable sensor */
                `$INSTANCE_NAME`_CSDDisconnectSns(curSnsIOPtr);
            }
        #else
            /* Disable sensor */
            `$INSTANCE_NAME`_CSDDisconnectSns(curSnsIOPtr);
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
            if (`$INSTANCE_NAME`_FREQ_CHANNEL_2 > `$INSTANCE_NAME`_scanFreqIndex)
            {
                 /* Scan the next channel */
                `$INSTANCE_NAME`_SsNextFrequencyScan();
            }
            else
            {
                 /* All channels are scanned. Set IMO to zero channel */
                `$INSTANCE_NAME`_scanFreqIndex = `$INSTANCE_NAME`_FREQ_CHANNEL_0;
                `$INSTANCE_NAME`_SsChangeClkFreq(`$INSTANCE_NAME`_FREQ_CHANNEL_0);

                 /* Scan the next sensor */
                `$INSTANCE_NAME`_SsCSDInitNextScan();
            }
        #else
            /* Scan the next sensor */
            `$INSTANCE_NAME`_SsCSDInitNextScan();
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
        }
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */

    #ifdef `$INSTANCE_NAME`_EXIT_CALLBACK
        `$INSTANCE_NAME`_ExitCallback();
    #endif /* `$INSTANCE_NAME`_EXIT_CALLBACK */
}


#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDPostMultiScanGanged
****************************************************************************//**
*
* \brief
*  This is an internal ISR function for the multiple sensor scanning
*  implementation for ganged sensors.
*
* \details
*  This ISR handler is triggered when the user calls the
*  `$INSTANCE_NAME`_Scan() API for a ganged sensor or the
*  `$INSTANCE_NAME`_ScanAllWidgets() API in the project with ganged sensors.
*
*  The following tasks are performed:
*    1. Disable the CSD interrupt.
*    2. Read the Counter register and update the data structure with raw data.
*    3. Connect the Vref buffer to the AMUX bus.
*    4. Disable the CSD block (after the widget has been scanned).
*    5. Update the Scan Counter.
*    6. Reset the BUSY flag.
*    7. Enable the CSD interrupt.
*
*  The ISR handler initializes scanning for the previous sensor when the
*  widget has more than one sensor.
*  The ISR handler initializes scanning for the next widget when the
*  `$INSTANCE_NAME`_ScanAllWidgets() APIs are called and the project has
*  more than one widget.
*  The ISR handler changes the IMO and initializes scanning for the next
*  frequency channels when multi-frequency scanning is enabled.
*
*  This function has two Macro Callbacks that allow calling the user
*  code from macros specified in component's generated code. Refer to the
*  \ref group_capsense_macrocallbacks section of the PSoC Creator User Guide
*  for details.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDPostMultiScanGanged(void)
{
    #ifdef `$INSTANCE_NAME`_ENTRY_CALLBACK
        `$INSTANCE_NAME`_EntryCallback();
    #endif /* `$INSTANCE_NAME`_ENTRY_CALLBACK */

        /* Clear pending interrupt */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

